app/Controllers/GenerarSolicitudCreditoController.php

SELECT *
FROM `solicitud`
WHERE `solicitud`.`id_solicitud` = '12'
---
    public function generarContrato($id_solicitud)
    {
        log_message("info", "***************************************generarContrato***************************************");
        $session = session();
        try {
            if ($id_solicitud) {
                $templatePath = FCPATH . 'public/documentos/contrato/contratoV1.docx';

                if (!file_exists($templatePath)) {
                    throw new \Exception('El archivo de plantilla no se encuentra en la ruta especificada.');
                }

                $templateProcessor = new TemplateProcessor($templatePath);

                // Obtener los datos de la solicitud y cliente
                $solicitudEncontrada = $this->solicitudesModel->find($id_solicitud);

INSERT INTO `contrato_solicitud` (`dir_contrato`, `id_sucursal`, `num_contrato`, `numero_solicitud`) VALUES ('C:\\xampp\\htdocs\\creditos\\public/documentos/000001/contrato_000001.docx', '1', '0001-00000042', '000001')
---
                    'num_contrato' => $numero_contrato,
                    'numero_solicitud' => $numeroSolicitud
                ];
                $this->contratoSolicitud->insert($datosInsert);