app/Controllers/SolicitudesController.php

    public function ver_solicitud()
    {
        try {
            $session = session();
            if (isset($_SESSION['sesion_activa']) && $_SESSION['sesion_activa'] === true) {
                $request = service('request');
                $encryptedSolicitud = $request->getGet('solicitud');
                log_message("info", "encryptedSolicitud::: " . $encryptedSolicitud);

                if ($encryptedSolicitud) {
                    $id_solicitud = base64_decode($encryptedSolicitud);
                    log_message("info", "numero de solicitud decrypted::: " . $id_solicitud);

                    # paso 1: recupero la información de la solicitud
                    $solicitudEncontrada = $this->solicitudesModel->find($id_solicitud);
---
SELECT *
FROM `solicitud`
WHERE `solicitud`.`id_solicitud` = '24'

    public function actualizarEstado()
    {
        try {
            $id_estado = $this->request->getPost('id_estado');
            $observacion = $this->request->getPost('observacion');
            $id_solicitud = $this->request->getPost('id_solicitud');

            if ($id_solicitud && !$id_estado && !$observacion) {
                // Obtienes la solicitud
                $numeroSoli = $this->solicitudesModel->find($id_solicitud);
---
SELECT *
FROM `solicitud`
WHERE `solicitud`.`id_solicitud` = '24'

                    ];

                    // Si se actualiza el estado correctamente
                    if ($this->solicitudesModel->update($id_solicitud, $dataUpdate)) {
---
UPDATE `solicitud` SET `id_estado_actual` = 2
WHERE `solicitud`.`id_solicitud` IN ('24')

    private function crearCobros($planPago, $id_solicitud)
    {
        try {
            $solicitudEncontrada = $this->solicitudesModel->find($id_solicitud);
---
SELECT *
FROM `solicitud`
WHERE `solicitud`.`id_solicitud` = '24'


                // Evitar registrar una cuota de prima si su valor es 0
                if ($i != 0 || $planPago[0]["valor_prima"] != 0) {
                    if ($this->cobrosModel->insert($data)) {
---
INSERT INTO `cobros` (`id_solicitud`, `numero_cuota`, `monto_cuota`, `descripcion`, `estado`, `fecha_pago`, `fecha_vencimiento`, `esPrima`) VALUES ('24', 1, '166.54', '', 'PENDIENTE', '', '2025-02-15', 0)