app/Models/ApoderadosModel.php

SELECT *
FROM `apoderados`
WHERE `estado` != 0
---
    public function getApoderados()
    {
        return $this->where('estado !=', 0)->findAll();