app/Models/CategoriasModel.php

SELECT *
FROM `categorias`
ORDER BY `id_categoria` DESC
---
    public function getCategorias()
    {
        return $this->orderBy('id_categoria', 'DESC')->findAll();