app/Models/ClientesModel.php

SELECT *
FROM `clientes`
ORDER BY `id_cliente` DESC
---
    public function getClientes()
    {
        return $this->orderBy('id_cliente', 'DESC')->findAll();

SELECT *
FROM `clientes`
WHERE `id_cliente` = 2
 LIMIT 1
---
    public function obtenerClientePorId($id_cliente)
    {
        return $cliente = $this->where('id_cliente', $id_cliente)->first();

SELECT *
FROM `clientes`
WHERE `dui` = '87877868-7'
 LIMIT 1
SELECT *
FROM `clientes`
WHERE `id_cliente` = 13
 LIMIT 1
---
    public function buscarCliente(?string $dui = null, ?int $id_cliente = null)
    {
        if ($dui) {
            // Realizar una consulta para verificar si ya existe un cliente con el mismo DUI
            $cliente = $this->where('dui', $dui)->first();
        } elseif ($id_cliente) {
            // Realizar una consulta para verificar si ya existe un cliente con el mismo ID
            $cliente = $this->where('id_cliente', $id_cliente)->first();