app/Models/CobrosModel.php

    public function getCobrosBySolicitud($id_solicitud)
    {
        return $this->where('id_solicitud', $id_solicitud)
            ->orderBy('numero_cuota', 'ASC')
            ->findAll();
---
SELECT *
FROM `cobros`
WHERE `id_solicitud` = 24
ORDER BY `numero_cuota` ASC