app/Models/ContratoSolicitudModel.php

    public function existeContratoPorSolicitud($numeroSolicitud)
    {
        return $this->where('numero_solicitud', $numeroSolicitud)->first() !== null;
---
SELECT *
FROM `contrato_solicitud`
WHERE `numero_solicitud` = '000001'
 LIMIT 1