app/Models/ContratoModel.php

SELECT `codigo_sucursal`
FROM `sucursal`
WHERE `id_sucursal` = '1'
---
    public function getCodigoSucursal($id_sucursal)
    {
        return $this->db->table('sucursal')
            ->select('codigo_sucursal')
            ->where('id_sucursal', $id_sucursal)
            ->get()
            ->getRow();

INSERT INTO `trigger_log` (`message`) VALUES ('Código de sucursal recuperado: 0001')
---
    public function insertarLog($message)
    {
        $this->db->table('trigger_log')->insert([
            'message' => $message
        ]);