app/Models/LoginModel.php

    public function validateUser($user)
{
    return $this->select([
            '*',
            'CONCAT(
                sucursal.sucursal, ", ",
                "departamento de ", d.nombre, ", ",
                "del municipio de ", m.nombre, ", ",
                "distrito de ", ds.nombre, ", ",
                "colonia ", c.nombre
            ) AS direccion_completa'
        ])
        ->join('sucursal', 'usuarios.id_sucursal = sucursal.id_sucursal')
        ->join('perfiles', 'usuarios.id_perfil = perfiles.id_perfil')
        ->join('departamentos d', 'd.id = sucursal.id_departamento')
        ->join('municipios m', 'm.id = sucursal.id_municipio')
        ->join('distritos ds', 'ds.id_distrito = sucursal.id_distrito')
        ->join('colonias c', 'c.id = sucursal.id_colonia')
        ->where('usuarios.dui', $user)
        ->findAll();
---
SELECT *
FROM `usuarios`
JOIN `sucursal` ON `usuarios`.`id_sucursal` = `sucursal`.`id_sucursal`
JOIN `perfiles` ON `usuarios`.`id_perfil` = `perfiles`.`id_perfil`
WHERE `usuarios`.`dui` = ('05682717-5')