app/Models/MunicipiosModel.php

    public function getMunicipiosByDepartamento($departamentoId)
    {
        return $this->where('departamento_id', $departamentoId)->findAll();
---
SELECT *
FROM `municipios`
WHERE `departamento_id` = '10'

    public function getMunicipioPorCodigo($codigo)
    {
        // Ajusta la consulta según la estructura de tu tabla
        return $this->where('id', $codigo)->first()['nombre'];
---
SELECT *
FROM `municipios`
WHERE `id` = '80'
 LIMIT 1