app/Models/ProductoSolicitudModel.php

    public function buscarPorSolicitudDescripcion($id_solicitud)
    {
        return $this->select([
            'productos_solicitud.id_producto',
            'productos.nombre',
            'productos.precio',
            'productos_solicitud.cantidad_producto'
        ])
            ->join('productos', 'productos.id_producto = productos_solicitud.id_producto')
            ->where('productos_solicitud.id_solicitud', $id_solicitud)
            ->findAll();
---
SELECT *
FROM `productos_solicitud`
JOIN `productos` ON `productos`.`id_producto` = `productos_solicitud`.`id_producto`
WHERE `id_solicitud` = '24'