app/Models/ReferenciaLaboralModel.php

SELECT `referencias_laborales`.*, `profesiones`.`descripcion`
FROM `referencias_laborales`
LEFT JOIN `profesiones` ON `referencias_laborales`.`id_profesion` = `profesiones`.`id_profesion`
WHERE `id_solicitud` = 24
---
    public function obtenerReferenciasPorSolicitud(int $id_solicitud)
    {
        // Realizar la consulta para obtener las referencias laborales por id_solicitud
        $referencias = $this->select('referencias_laborales.*, profesiones.descripcion')
                            ->join('profesiones', 'referencias_laborales.id_profesion = profesiones.id_profesion', 'left')
                            ->where('id_solicitud', $id_solicitud)
                            ->findAll();