app/Models/SolicitudModel.php

    public function getUltimaSolicitudCliente($id_cliente)
{
    return $this->select('*') // Selecciona todos los campos
        ->where('id_cliente', $id_cliente) // Filtra por el cliente
        ->orderBy('fecha_creacion', 'DESC') // Ordena por fecha_creacion en orden descendente
        ->first(); // Devuelve el primer registro de los resultados
---
SELECT *
FROM `solicitud`
WHERE `id_cliente` = '13'
ORDER BY `fecha_creacion` DESC
 LIMIT 1